Revit 2026 API

# VertexPositionNormalColored Class

---

A geometry vertex specified as a position in space with a normal vector and a color.

SystemObject Autodesk.Revit.DB.DirectContext3DVertex Autodesk.Revit.DB.DirectContext3DVertexPositionNormalColored

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexPositionNormalColored : Vertex
```
```vb
Public Class VertexPositionNormalColored
	Inherits Vertex
```
```cpp
public ref class VertexPositionNormalColored : public Vertex
```
```fsharp
type VertexPositionNormalColored =
    class
        inherit Vertex
    end
```

The VertexPositionNormalColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexPositionNormalColored | Constructs the vertex from a point, a normal vector, and a color. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from Vertex) |
|  | Normal | The vertex's normal vector. |
|  | Position | The vertex's position. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from Vertex) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetColor | Gets the vertex's color. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetColor | Sets the vertex's color. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The color of these vertices includes a transparency component In order to render them as transparent they must be rendered in the transparent pass See the 'IsTransparentPass' method of DrawContext

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace